## Week1 task4.4 even_odd_interval.py

a = input("Enter a: ")
b = input("Enter b: ")

a = int(a)
b = int(b)

if  a >= b: 
    a,b = b,a ##:)##Незнам дали не чупи идeята на заданието, но определено ми харесва инверсията на променливите.Крайният резултат е един и същ. Също така в заданието е казано да въведем А и Б не е казано, кое е горна или долна граница както в даденото решение. Надявам се да не дразня!:)
	
while a <= b:
    
    n = a

    if n % 2 == 0:
        print(str(n) + " - even")
    else:
        print(str(n) + " - odd")
    a += 1
